let countBtn = document.getElementById("count-btn");
let countDBtn = document.getElementById("countD-btn");

let duaTitle = document.getElementById("dua-title");
let duaText = document.getElementById("dua-text")

let stepOne = document.getElementById("step-one");
let stepTwo = document.getElementById("step-two");
let stepThree = document.getElementById("step-three");

let count = document.getElementById("count");
let countTotal = document.getElementById("count-total");
let countValue = 0;
let countValue2 = 0;
let countValue3 = 0;
let countValue4 = 0;
let countValue5 = 0;
let countValue6 = 0;
let countValue7 = 0;
let countValue8 = 0;
let countValue9 = 0;
let countValue10 = 0;
let countValue11 = 0;
let countValue12 = 0;
let countValue13 = 0;
let countValue14 = 0;
let countValue15 = 0;
let countValue16 = 0;
let countValue17 = 0;
let countValue18 = 0;
let countValue19 = 0;
let countValue20 = 0;
let countValue21 = 0;
let countValue22 = 0;

let countTotalValue = 0;

countBtn.addEventListener('click',function(){
    if(countValue < 1){
        countValue += 1;
        count.innerText = countValue;
        duaTitle.innerText = "১নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;
    }else if(countValue2 < 3){
        countValue2 += 1;
        count.innerText = countValue2;
        duaTitle.innerText = "2নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue3 < 7){
        countValue3 += 1;
        count.innerText = countValue3;
        duaTitle.innerText = "3নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue4 < 1){
        countValue4 += 1;
        count.innerText = countValue4;
        duaTitle.innerText = "4নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue5 < 3){
        countValue5 += 1;
        count.innerText = countValue5;
        duaTitle.innerText = "5নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue6 < 3){
        countValue6 += 1;
        count.innerText = countValue6;
        duaTitle.innerText = "6নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue7 < 3){
        countValue7 += 1;
        count.innerText = countValue7;
        duaTitle.innerText = "7নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue8 < 3){
        countValue8 += 1;
        count.innerText = countValue8;
        duaTitle.innerText = "8নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue9 < 3){
        countValue9 += 1;
        count.innerText = countValue9;
        duaTitle.innerText = "9নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue10 < 3){
        countValue10 += 1;
        count.innerText = countValue10;
        duaTitle.innerText = "10নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue11 < 3){
        countValue11 += 1;
        count.innerText = countValue11;
        duaTitle.innerText = "11নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue12 < 3){
        countValue12 += 1;
        count.innerText = countValue12;
        duaTitle.innerText = "12নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue13 < 3){
        countValue13 += 1;
        count.innerText = countValue13;
        duaTitle.innerText = "13নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue14 < 3){
        countValue14 += 1;
        count.innerText = countValue14;
        duaTitle.innerText = "14নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue15 < 3){
        countValue15 += 1;
        count.innerText = countValue15;
        duaTitle.innerText = "15নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue16 < 3){
        countValue16 += 1;
        count.innerText = countValue16;
        duaTitle.innerText = "16নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue17 < 3){
        countValue17 += 1;
        count.innerText = countValue17;
        duaTitle.innerText = "17নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue18 < 3){
        countValue18 += 1;
        count.innerText = countValue18;
        duaTitle.innerText = "18নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue19 < 3){
        countValue19 += 1;
        count.innerText = countValue19;
        duaTitle.innerText = "19নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue20 < 3){
        countValue20 += 1;
        count.innerText = countValue20;
        duaTitle.innerText = "12নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue21 < 3){
        countValue21 += 1;
        count.innerText = countValue21;
        duaTitle.innerText = "12নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else if(countValue22 < 3){
        countValue22 += 1;
        count.innerText = countValue22;
        duaTitle.innerText = "12নং জিকির : আয়াতুল কুরসী (সকাল - সন্ধ্যা ১ বার )";
        duaText.innerText = `        
            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ
            اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
        `;

    }else{
        countValue3 += 1;
        count.innerText = countValue3;
    }
    countTotalValue += 1;
    countTotal.innerText = countTotalValue;

    if(countTotalValue >= 33){
        stepOne.className = "step step-secondary";
    }
    if(countTotalValue >= 66){
        stepTwo.className = "step step-secondary";
    }
    if(countTotalValue >= 99){
        stepThree.className = "step step-secondary";
    }
    
})

// Progress 

let progress = document.getElementById("progress"); 
let progressText = document.getElementById("progress-text");
let progressValue = 0;
let progressTextValue = 0;

let progressValue2 = 0;
let progressTextValue2 = 0;

let progressValue3 = 0;
let progressTextValue3 = 0;

countBtn.addEventListener('click',function(){
    if(progressValue < 1){
        progressTextValue += 100;
        progressText.innerText = Math.ceil(progressTextValue);
        progressValue += 100;
        progressValue.innerText = Math.ceil(progressTextValue);
        progress.setAttribute("style",`--value:${progressValue};--size:4rem; --thickness: 6px;`);
        console.log(progress);
    }else if(progressValue2 < 7){
        progressTextValue2 += 14.28;
        progressText.innerText = Math.ceil(progressTextValue2);
        progressValue2 += 14.28;
        progressValue2.innerText = Math.ceil(progressTextValue2);
        progress.setAttribute("style",`--value:${progressValue2};--size:4rem; --thickness: 6px;`);

    }else if(progressValue3 < 99){
        progressTextValue3 += 3.03;
        progressText.innerText = Math.ceil(progressTextValue3);
        progressValue3 += 3.03;
        progressValue3.innerText = Math.ceil(progressTextValue3);
        progress.setAttribute("style",`--value:${progressValue3};--size:4rem; --thickness: 6px;`);
    }
    
})


// Total Progress

// let totalProgress = document.getElementById("total-progress"); 
// let totalProgressText = document.getElementById("total-progress-text");
// let totalProgressValue = 0;
// let totalProgressTextValue = 0;

// let totalProgressValue2 = 0;
// let totalProgressTextValue2 = 0;

// let totalProgressValue3 = 0;
// let totalProgressTextValue3 = 0;

// countBtn.addEventListener('click',function(){
//     if(totalProgressValue < 99){
//         totalProgressTextValue += 1.01;
//         totalProgressText.innerText = Math.ceil(totalProgressTextValue);
//         totalProgressValue += 1.01;
//         totalProgressValue.innerText = Math.ceil(totalProgressTextValue);
//         totalProgress.setAttribute("style",`--value:${totalProgressValue};--size:4rem; --thickness: 6px;`);
//         console.log(progress);
//     }  
// })


// countBtn.addEventListener('click',function(){
//     if(countTotalValue >=99){
//         countBtn.setAttribute('disabled', 'disabled');
//         let masaallahImg = document.getElementById("masaallah-img");
//         masaallahImg.setAttribute("class","w-96 left-0 top-40 rotate-[40deg] absolute -ml-40");
//     }
// })